# THE Impact Rankings 2025
- https://www.timeshighereducation.com/impactrankings
- part : #!/length/-1/sort_by/rank/sort_order/asc/cols/scores
- https://www.timeshighereducation.com/impactrankings#!/length/-1/sort_by/rank/sort_order/asc

In [ ]:
#URLS
#urls = ["https://www.timeshighereducation.com/world-university-rankings/2023/regional-ranking/", "https://www.timeshighereducation.com/world-university-rankings/2024/regional-ranking/", "https://www.timeshighereducation.com/world-university-rankings/2025/regional-ranking"]
#part1 = '#!/length/-1/sort_by/rank/sort_order/asc/cols/scores/'
#urls[0] + part1
url1 ='https://www.timeshighereducation.com/impactrankings'
url ='https://www.timeshighereducation.com/impactrankings#!/length/-1/sort_by/rank/sort_order/asc'
url

In [ ]:
import requests
import urllib
from bs4 import BeautifulSoup
response = requests.get('http://google.com')
assert response.status_code < 400

In [ ]:
#function check if url exists
import httpx
from bs4 import BeautifulSoup

def get_title_httpx(url):
    try:
        with httpx.Client(timeout=5) as client:
            response = client.get(url)
            if response.status_code == 200:
                soup = BeautifulSoup(response.text, 'html.parser')
                return soup.title.string.strip() if soup.title else "No title found"
            else:
                return f"Status code: {response.status_code}"
    except httpx.RequestError as e:
        return f"Error: {e}"

In [ ]:
print(get_title_httpx("https://www.python.org"))
print(get_title_httpx(url))

In [ ]:
#install libraries if required

In [ ]:
from selenium import webdriver
from selenium.webdriver.chrome.service import Service
from webdriver_manager.chrome import ChromeDriverManager
from selenium.webdriver.common.by import By
from selenium.webdriver.chrome.options import Options
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC
from selenium.common.exceptions import TimeoutException
import time
import pandas as pd
import numpy as np
import re

In [ ]:
pd.set_option('max_colwidth',None)

In [ ]:
# Setup Chrome options
options = Options()
options.add_argument("--start-maximized")
options.add_argument("--disable-notifications")

In [ ]:
# Download location
prefs = { "download.prompt_for_download": False, "download.default_directory": "/Users/du/dup/auData/download"}
options.add_experimental_option("prefs", prefs)

In [ ]:
cp2 = '/opt/homebrew/bin/chromedriver'  # Replace with the actual path to your chromedriver

In [ ]:
#start driver
cService = webdriver.ChromeService(executable_path=cp2)
driver = webdriver.Chrome(service = cService)
driver.get(url)
wait = WebDriverWait(driver, 3)
print(driver.title)

In [ ]:
# Maximize window and wait for page to load
driver.maximize_window()
time.sleep(5)  
driver.find_element(By.ID,'CybotCookiebotDialogBodyButtonDecline').click()

In [ ]:
year = re.search(r'\d{4}', driver.title).group()
print(driver.title, 'Year - ' , year)

In [ ]:
#check if table element exists
table = driver.find_element(By.ID,'datatable-1')
table

In [ ]:
table.text[0:1000]

In [ ]:
# Locate the table header row
header_elements = driver.find_elements(By.CSS_SELECTOR, '#datatable-1 thead th')
# Extract and print header text
headers = [header.text.strip() for header in header_elements]
print(headers)

In [ ]:
# Another way to download Headings
thead = driver.find_element(By.CSS_SELECTOR, '#datatable-1 thead')
thead
th_elements = thead.find_elements(By.TAG_NAME, "th")
th_elements
header_list = [th.text.strip() for th in th_elements]
header_list

## HTML STRUCTURE
<tbody>
    <tr>
        <td class="rank sorting_1 sorting_2">1</td>
        <td class="name namesearch">
            <a class="ranking-institution-title" href="/world-university-rankings/western-sydney-university" data-position="title" data-mz="">Western Sydney University</a>
            <div class="location"><span><a href="/location/a4zw0000000GnyFAAS">Australia</a></span></div> </td>
        <td class="best-scores">
            <div class="sdg-score-multi">
                <div class="sdg-score-multi_item">
                    <div class="sdg-score-multi_number">15</div>
                    <div class="sdg-score-multi_value-wrapper">
                        <div class="sdg-score-multi_value"> <p>95.1</p> </div> </div></div>
                 <div class="sdg-score-multi_item">
                    <div class="sdg-score-multi_number">12</div>
                    <div class="sdg-score-multi_value-wrapper">
                        <div class="sdg-score-multi_value"><p>92.6</p> </div> </div></div>       
                 <div class="sdg-score-multi_item">
                    <div class="sdg-score-multi_number">11 </div>
                    <div class="sdg-score-multi_value-wrapper">
                        <div class="sdg-score-multi_value"><p>92.2</p> </div> </div></div>         
                <div class="sdg-score-multi_item">
                    <div class="sdg-score-multi_number">17 </div>
                    <div class="sdg-score-multi_value-wrapper">
                        <div class="sdg-score-multi_value"><p>98.1</p> </div> </div></div>
            </div>
        </td>
        <td class=" scores overall-score">98.7</td>
    </tr>
</tbody>

### Selectors
- row //*[@id="datatable-1"]/tbody
- rank th[aria-label='Rank: activate to sort column ascending']

In [132]:
# Step 1: Find all rows inside tbody
rows = driver.find_elements(By.CSS_SELECTOR, "table#datatable-1 tbody tr")
rows[0:5] #if 5 elements are shown

[<selenium.webdriver.remote.webelement.WebElement (session="3d8a5caac536fcfcfb6ba5aba3a2cb45", element="f.45772AD9ADD03D76F52CC2E0B279BE3D.d.249C47E654DEE146905C34F3D376FFCA.e.1774")>,
 <selenium.webdriver.remote.webelement.WebElement (session="3d8a5caac536fcfcfb6ba5aba3a2cb45", element="f.45772AD9ADD03D76F52CC2E0B279BE3D.d.249C47E654DEE146905C34F3D376FFCA.e.1652")>,
 <selenium.webdriver.remote.webelement.WebElement (session="3d8a5caac536fcfcfb6ba5aba3a2cb45", element="f.45772AD9ADD03D76F52CC2E0B279BE3D.d.249C47E654DEE146905C34F3D376FFCA.e.1700")>,
 <selenium.webdriver.remote.webelement.WebElement (session="3d8a5caac536fcfcfb6ba5aba3a2cb45", element="f.45772AD9ADD03D76F52CC2E0B279BE3D.d.249C47E654DEE146905C34F3D376FFCA.e.1775")>,
 <selenium.webdriver.remote.webelement.WebElement (session="3d8a5caac536fcfcfb6ba5aba3a2cb45", element="f.45772AD9ADD03D76F52CC2E0B279BE3D.d.249C47E654DEE146905C34F3D376FFCA.e.1776")>]

In [155]:
rows2 = driver.find_elements(By.XPATH, "//tr[contains(@class, 'js-row') and not(contains(@class, 'institution-disabled'))]")
len(rows2)

2232

In [156]:
sdg_container = rows2[1].find_element(By.CSS_SELECTOR, "td.best-scores .sdg-score-multi")
sdg_container
sdg_items = sdg_container.find_elements(By.CLASS_NAME, "sdg-score-multi__item")
sdg_items  #4 items
rank = rows2[1700].find_element(By.CSS_SELECTOR, "td.rank.sorting_1.sorting_2").text.strip()
name = rows2[1700].find_element(By.CSS_SELECTOR, "td.name a.ranking-institution-title").text.strip()
country = rows2[1700].find_element(By.CSS_SELECTOR, "td.name .location span a").text.strip()
print(rank, name, country)

1501+ ICFAI University, Dehradun India

In [157]:
sdg_scores = {}
sdg_container = rows2[1].find_element(By.CSS_SELECTOR, "td.best-scores .sdg-score-multi")
sdg_container
sdg_items = sdg_container.find_elements(By.CLASS_NAME, "sdg-score-multi__item")
sdg_items  #4 items
for item in sdg_items:
        number = item.find_element(By.CLASS_NAME, "sdg-score-multi__number").text.strip()
        value = item.find_element(By.CLASS_NAME, "sdg-score-multi__value p").text.strip()
        sdg_scores[number] = value
        print(number, value)

11 95.3
15 95.9
12 93.5
17 94.5

In [183]:
all_data = []
i=0
#print(rows[0:1])
for row in rows2:
    i = i + 1
    rank = row.find_element(By.CSS_SELECTOR, "td.rank.sorting_1.sorting_2").text.strip()
    name = row.find_element(By.CSS_SELECTOR, "td.name a.ranking-institution-title").text.strip()
    country = row.find_element(By.CSS_SELECTOR, "td.name .location span a").text.strip()
    # Find SDG container *within this row*
    sdg_container = row.find_element(By.CSS_SELECTOR, "td.best-scores .sdg-score-multi")
    # Now find each SDG item within that container
    sdg_items = sdg_container.find_elements(By.CLASS_NAME, "sdg-score-multi__item")
    sdg_scores = {}
    for item in sdg_items:
        number = item.find_element(By.CLASS_NAME, "sdg-score-multi__number").text.strip()
        value = item.find_element(By.CLASS_NAME, "sdg-score-multi__value p").text.strip()
        sdg_scores[number] = value
        #print(number, value)
    overall = row.find_element(By.CSS_SELECTOR, "td.scores.overall-score").text.strip()
    #print(i, rank, name)
    #print('Rank is ', rank, ', Name is', name, ', Country is ', country, ', Overall Score - ', overall, ' Other Scores ', sdg_scores) #, name, country)   
    all_data.append({   "rank": rank, "university": name, "country": country,  "sdg_scores": sdg_scores, "overall_score": overall })
    #all_data.append({   "rank": rank, "university": name, "country": country,  "overall_score": overall })
print("No of rows extracted ", i)

No of rows extracted  2232

In [184]:
type(all_data)

list

In [185]:
len(all_data)

2232

In [187]:
sdata= all_data[0:2]
sdata

[{'rank': '1',
  'university': 'Western Sydney University',
  'country': 'Australia',
  'sdg_scores': {'15': '95.1', '12': '92.6', '11': '92.2', '17': '98.1'},
  'overall_score': '98.7'},
 {'rank': '2',
  'university': 'University of Manchester',
  'country': 'United Kingdom',
  'sdg_scores': {'11': '95.3', '15': '95.9', '12': '93.5', '17': '94.5'},
  'overall_score': '98.4'}]

In [188]:
# Print or convert to DataFrame
for record in all_data[0:2]:    print(record)

{'rank': '1', 'university': 'Western Sydney University', 'country': 'Australia', 'sdg_scores': {'15': '95.1', '12': '92.6', '11': '92.2', '17': '98.1'}, 'overall_score': '98.7'}
{'rank': '2', 'university': 'University of Manchester', 'country': 'United Kingdom', 'sdg_scores': {'11': '95.3', '15': '95.9', '12': '93.5', '17': '94.5'}, 'overall_score': '98.4'}

In [189]:
sdg_scores_list = [entry['sdg_scores'] for entry in sdata if 'sdg_scores' in entry]
for i, scores in enumerate(sdg_scores_list, 1):
    print(f"Entry {i} SDG Scores: {scores}")

Entry 1 SDG Scores: {'15': '95.1', '12': '92.6', '11': '92.2', '17': '98.1'}
Entry 2 SDG Scores: {'11': '95.3', '15': '95.9', '12': '93.5', '17': '94.5'}

In [190]:
flat_data = []
for entry in all_data:
    base = {k: v for k, v in entry.items() if k != 'sdg_scores'}
    if 'sdg_scores' in entry:
        for i, (sdg_no, sdg_val) in enumerate(entry['sdg_scores'].items(), start=1):
            base[f'SDG{i}_no'] = sdg_no
            base[f'SDG{i}_value'] = sdg_val
    flat_data.append(base)

df = pd.DataFrame(flat_data)
print(df.shape)

(2232, 12)

In [232]:
df1 = df.copy()

In [233]:
df1.head()

,rank,university,country,overall_score,SDG1_no,SDG1_value,SDG2_no,SDG2_value,SDG3_no,SDG3_value,SDG4_no,SDG4_value
0,1,Western Sydney University,Australia,98.7,15,95.1,12,92.6,11,92.2,17,98.1
1,2,University of Manchester,United Kingdom,98.4,11,95.3,15,95.9,12,93.5,17,94.5
2,3,Kyungpook National University (KNU),South Korea,97.8,8,92.0,9,99.5,15,91.6,17,96.8
3,=4,Griffith University,Australia,97.7,15,95.6,6,91.8,14,94.3,17,96.4
4,=4,University of Tasmania,Australia,97.7,15,96.1,13,93.2,14,90.1,17,96.2

In [234]:
# Step 1: Add serial number
df1.insert(0, 'ser', range(1, len(df) + 1))
df1.head()

,ser,rank,university,country,overall_score,SDG1_no,SDG1_value,SDG2_no,SDG2_value,SDG3_no,SDG3_value,SDG4_no,SDG4_value
0,1,1,Western Sydney University,Australia,98.7,15,95.1,12,92.6,11,92.2,17,98.1
1,2,2,University of Manchester,United Kingdom,98.4,11,95.3,15,95.9,12,93.5,17,94.5
2,3,3,Kyungpook National University (KNU),South Korea,97.8,8,92.0,9,99.5,15,91.6,17,96.8
3,4,=4,Griffith University,Australia,97.7,15,95.6,6,91.8,14,94.3,17,96.4
4,5,=4,University of Tasmania,Australia,97.7,15,96.1,13,93.2,14,90.1,17,96.2

In [235]:
df1.head()

,ser,rank,university,country,overall_score,SDG1_no,SDG1_value,SDG2_no,SDG2_value,SDG3_no,SDG3_value,SDG4_no,SDG4_value
0,1,1,Western Sydney University,Australia,98.7,15,95.1,12,92.6,11,92.2,17,98.1
1,2,2,University of Manchester,United Kingdom,98.4,11,95.3,15,95.9,12,93.5,17,94.5
2,3,3,Kyungpook National University (KNU),South Korea,97.8,8,92.0,9,99.5,15,91.6,17,96.8
3,4,=4,Griffith University,Australia,97.7,15,95.6,6,91.8,14,94.3,17,96.4
4,5,=4,University of Tasmania,Australia,97.7,15,96.1,13,93.2,14,90.1,17,96.2

In [236]:
# Step 2: Clean 'rank'
def clean_rank(val):
    if pd.isna(val): return np.nan
    val = re.sub(r'[^\d\-–]', '', str(val))  # remove non-digit/range chars
    if '-' in val or '–' in val:
        parts = re.split(r'[-–]', val)
        try:
            return np.mean([int(p.strip()) for p in parts if p.strip().isdigit()])
        except:
            return np.nan
    return int(val)

df1['rank2'] = df1['rank'].apply(clean_rank)
df1['rank2'] = df1['rank2'].fillna(-1).astype(int)
# Step 3: Clean 'overall_score'
def clean_score(val):
    if pd.isna(val): return np.nan
    val = str(val)
    if '-' in val or '–' in val:
        parts = re.split(r'[-–]', val)
        try:
            return np.mean([float(p.strip()) for p in parts])
        except:
            return np.nan
    try:
        return float(val)
    except:
        return np.nan

df1['overall_score2'] = df1['overall_score'].apply(clean_score)

In [237]:
df1.head()

,ser,rank,university,country,overall_score,SDG1_no,SDG1_value,SDG2_no,SDG2_value,SDG3_no,SDG3_value,SDG4_no,SDG4_value,rank2,overall_score2
0,1,1,Western Sydney University,Australia,98.7,15,95.1,12,92.6,11,92.2,17,98.1,1,98.7
1,2,2,University of Manchester,United Kingdom,98.4,11,95.3,15,95.9,12,93.5,17,94.5,2,98.4
2,3,3,Kyungpook National University (KNU),South Korea,97.8,8,92.0,9,99.5,15,91.6,17,96.8,3,97.8
3,4,=4,Griffith University,Australia,97.7,15,95.6,6,91.8,14,94.3,17,96.4,4,97.7
4,5,=4,University of Tasmania,Australia,97.7,15,96.1,13,93.2,14,90.1,17,96.2,4,97.7

In [193]:
#driver.refresh()
#driver.quit()

In [238]:
# Step 1: Identify the columns to melt
id_vars = ['ser','rank','rank2', 'university', 'country', 'overall_score','overall_score2']
value_vars = [col for col in df1.columns if col.startswith('SDG')]
# Step 2: Melt the dataframe to long format
df_melted = df1.melt(id_vars=id_vars, value_vars=value_vars, var_name='sdg_type', value_name='sdg_info')
df_melted

,ser,rank,rank2,university,country,overall_score,overall_score2,sdg_type,sdg_info
0,1,1,1,Western Sydney University,Australia,98.7,98.7,SDG1_no,15
1,2,2,2,University of Manchester,United Kingdom,98.4,98.4,SDG1_no,11
2,3,3,3,Kyungpook National University (KNU),South Korea,97.8,97.8,SDG1_no,8
3,4,=4,4,Griffith University,Australia,97.7,97.7,SDG1_no,15
4,5,=4,4,University of Tasmania,Australia,97.7,97.7,SDG1_no,15
...,...,...,...,...,...,...,...,...,...
17851,2228,1501+,1501,Zarqa University,Jordan,1.7–49.7,25.7,SDG4_value,63.3–69.9
17852,2229,1501+,1501,Zaytoonah International University,Syria,1.7–49.7,25.7,SDG4_value,2.1–44.7
17853,2230,1501+,1501,Zewail City of Science and Technology,Egypt,1.7–49.7,25.7,SDG4_value,44.8–58.0
17854,2231,1501+,1501,Zhytomyr Ivan Franko State University,Ukraine,1.7–49.7,25.7,SDG4_value,2.1–44.7
17855,2232,1501+,1501,Ziane Achour University of Djelfa,Algeria,1.7–49.7,25.7,SDG4_value,2.1–44.7

In [239]:
# Step 3: Create group key for each SDG set
df_melted['sdg_group'] = df_melted['sdg_type'].str.extract(r'(\d+)')  # Extract the number from column name
df_melted['sdg_field'] = df_melted['sdg_type'].str.extract(r'(no|value)')  # no or value

# Step 4: Pivot back to one row per SDG with separate columns for no and value
df_final = df_melted.pivot_table(index=id_vars + ['sdg_group'], 
                                 columns='sdg_field', 
                                 values='sdg_info',
                                 aggfunc='first').reset_index()

# Step 5: Rename columns for clarity
df_final = df_final.rename(columns={'no': 'SDG_no', 'value': 'SDG_value'})

# Optional: Sort if needed
df_final = df_final.sort_values(['rank', 'SDG_no'])

# Preview the result
df_final.head()

sdg_field,ser,rank,rank2,university,country,overall_score,overall_score2,sdg_group,SDG_no,SDG_value
2,1,1,1,Western Sydney University,Australia,98.7,98.7,3,11,92.2
1,1,1,1,Western Sydney University,Australia,98.7,98.7,2,12,92.6
0,1,1,1,Western Sydney University,Australia,98.7,98.7,1,15,95.1
3,1,1,1,Western Sydney University,Australia,98.7,98.7,4,17,98.1
3949,988,1001–1500,1250,Al-Ayen University,Iraq,49.8–60.8,55.3,2,1,57.6–62.4

In [241]:
# Step 3: Clean 'overall_score'
def clean_score(val):
    if pd.isna(val): return np.nan
    val = str(val)
    if '-' in val or '–' in val:
        parts = re.split(r'[-–]', val)
        try:
            return np.mean([float(p.strip()) for p in parts])
        except:
            return np.nan
    try:
        return float(val)
    except:
        return np.nan

df_final['SDG_value2'] = df_final['SDG_value'].apply(clean_score)

In [242]:
df_final.head()

sdg_field,ser,rank,rank2,university,country,overall_score,overall_score2,sdg_group,SDG_no,SDG_value,SDG_value2
2,1,1,1,Western Sydney University,Australia,98.7,98.7,3,11,92.2,92.2
1,1,1,1,Western Sydney University,Australia,98.7,98.7,2,12,92.6,92.6
0,1,1,1,Western Sydney University,Australia,98.7,98.7,1,15,95.1,95.1
3,1,1,1,Western Sydney University,Australia,98.7,98.7,4,17,98.1,98.1
3949,988,1001–1500,1250,Al-Ayen University,Iraq,49.8–60.8,55.3,2,1,57.6–62.4,60.0

In [243]:
df_final.to_csv("/Users/du/dup/auData/ranking/the/theimpact25b.csv", index=False)

In [245]:
df_final[['ser','rank2','university', 'country','overall_score2', 'SDG_no','SDG_value2']].head(10)

sdg_field,ser,rank2,university,country,overall_score2,SDG_no,SDG_value2
2,1,1,Western Sydney University,Australia,98.7,11,92.20
1,1,1,Western Sydney University,Australia,98.7,12,92.60
0,1,1,Western Sydney University,Australia,98.7,15,95.10
3,1,1,Western Sydney University,Australia,98.7,17,98.10
3949,988,1250,Al-Ayen University,Iraq,55.3,1,60.00
3954,989,1250,Al-Azhar University,Egypt,55.3,1,49.35
3985,997,1250,Al-Nahrain University,Iraq,55.3,1,55.20
3998,1000,1250,Al Turath University,Iraq,55.3,1,42.60
4000,1001,1250,American University of Nigeria,Nigeria,55.3,1,60.00
4030,1008,1250,Antonio Nariño University,Colombia,55.3,1,42.60

In [ ]:
#end here , complete